<script>
export default{
    data(){
        return{
            selectYear:"",
            selectedRiver:'' // 選擇的河流
        }
    },
    methods:{
        selectRiver(riverName) {
            this.selectedRiver = riverName;
        }
    }
}
</script>


<template>
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.5.2/css/all.min.css" integrity="sha512-SnH5WK+bZxgPHs44uWIX+LLJAJ9/2PkPKZ5QiAj6Ta86w+fsb2TkcmfRyVX3pBnMFcV7oQPJkl9QevSCWr3W6A==" crossorigin="anonymous" referrerpolicy="no-referrer" />

    <div class="backGround">
        <div class="map" id="app">
            <img src="../components/河川圖.png" alt="" class="kawaTW">
            <p class="A" @click="selectRiver('淡水河')">淡水河</p>
            <p class="B" @click="selectRiver('頭前溪')">頭前溪</p>
            <p class="C" @click="selectRiver('後龍溪')">後龍溪</p>
            <p class="D" @click="selectRiver('大安溪')">大安溪</p>
            <p class="E" @click="selectRiver('大甲溪')">大甲溪</p>
            <p class="F" @click="selectRiver('烏溪')">烏溪</p>
            <p class="G" @click="selectRiver('濁水溪')">濁水溪</p>
            <p class="H" @click="selectRiver('北港溪')">北港溪</p>
            <p class="I" @click="selectRiver('朴子溪')">朴子溪</p>
            <p class="J" @click="selectRiver('八掌溪')">八掌溪</p>
            <p class="K" @click="selectRiver('急水溪')">急水溪</p>
            <p class="L" @click="selectRiver('曾文溪')">曾文溪</p>
            <p class="M" @click="selectRiver('鹽水溪')">鹽水溪</p>
            <p class="N" @click="selectRiver('二仁溪')">二仁溪</p>
            <p class="O" @click="selectRiver('高屏溪')">高屏溪</p>
            <p class="P" @click="selectRiver('東港溪')">東港溪</p>
            <p class="Q" @click="selectRiver('林邊溪')">林邊溪</p>
            <p class="R" @click="selectRiver('蘭陽溪')">蘭陽溪</p>
            <p class="S" @click="selectRiver('花蓮溪')">花蓮溪</p>
            <p class="T" @click="selectRiver('秀姑巒溪')">秀姑巒溪</p>
            <p class="U" @click="selectRiver('卑南溪')">卑南溪</p>
        </div>
        <div class="info">
            <div class="riverName" >
                <select name="" id="" v-model="this.selectYear">
                    <option value="">請選擇年份</option>
                    <option value="102">102年</option>
                    <option value="103">103年</option>
                    <option value="104">104年</option>
                    <option value="105">105年</option>
                    <option value="106">106年</option>
                    <option value="107">107年</option>
                    <option value="108">108年</option>
                    <option value="109">109年</option>
                    <option value="110">110年</option>
                    <option value="111">111年</option>
                </select>
                <h2 class="river">{{this.selectedRiver}}</h2>
                <i class="fa-sharp fa-solid fa-location-dot fa-fade" style="color: #ff0a54;"></i>
                <p class="cityName">台北市</p>
            </div>
            <div class="rpiCard"> <!-- 翻轉圈圈 -->
                <div class="front size">
                    <h5>RPI</h5>
                    <P class="rpiNum">1.5</P>
                    <h5 value="">良好</h5>
                </div>
                <div class="back size">
                    <i class="fa-regular fa-face-smile-beam"></i>
                </div>
            </div>
            <div class="testValue"> <!-- 監測數值 -->
                <p v-if="this.selectYear == '102' && selectedRiver === '淡水河'"> 監測站數_______________ 38 溶氧量平均值___________ 6.7 生化需氧量平均值_______ 2.9 懸浮固體平均值________ 17.9 氨氮平均值____________ 1.19 溶氧量最大值__________ 12.9 生化需氧量最大值______ 28.2 懸浮固體最大值________ 100 氨氮最大值____________ 8.9</p>
                <p v-if="this.selectYear == '103' && selectedRiver === '淡水河'"> 監測站數_______________ 38 溶氧量平均值___________ 6.8 生化需氧量平均值_______ 2.7 懸浮固體平均值________ 19.3 氨氮平均值____________ 1.22 溶氧量最大值__________ 13.9 生化需氧量最大值______ 39.4 懸浮固體最大值________ 96 氨氮最大值____________ 15</p>
                <p v-if="this.selectYear == '104' && selectedRiver === '淡水河'"> 監測站數_______________ 38 溶氧量平均值___________ 6.5 生化需氧量平均值_______ 2.9 懸浮固體平均值________ 34.2 氨氮平均值____________ 1.37 溶氧量最大值__________ 13 生化需氧量最大值______ 40 懸浮固體最大值________ 891 氨氮最大值____________ 9.29</p>
                <p v-if="this.selectYear == '105' && selectedRiver === '淡水河'"> 監測站數_______________ 38 溶氧量平均值___________ 6.8 生化需氧量平均值_______ 2.5 懸浮固體平均值________ 17.6 氨氮平均值____________ 1.06 溶氧量最大值__________ 16.6 生化需氧量最大值______ 19.4 懸浮固體最大值________ 418 氨氮最大值____________ 7.87</p>
                <p v-if="this.selectYear == '106' && selectedRiver === '淡水河'"> 監測站數_______________ 38 溶氧量平均值___________ 6.8 生化需氧量平均值_______ 2.4 懸浮固體平均值________ 18.5 氨氮平均值____________ 1.07 溶氧量最大值__________ 17.1 生化需氧量最大值______ 16.8 懸浮固體最大值________ 244 氨氮最大值____________ 10.4</p>
                <p v-if="this.selectYear == '107' && selectedRiver === '淡水河'"> 監測站數_______________ 38 溶氧量平均值___________ 6.7 生化需氧量平均值_______ 3.3 懸浮固體平均值________ 17.2 氨氮平均值____________ 1.16 溶氧量最大值__________ 12.2 生化需氧量最大值______ 139 懸浮固體最大值________ 99 氨氮最大值____________ 8.34</p>
                <p v-if="this.selectYear == '108' && selectedRiver === '淡水河'"> 監測站數_______________ 38 溶氧量平均值___________ 6.6 生化需氧量平均值_______ 2.3 懸浮固體平均值________ 14.4 氨氮平均值____________ 1.04 溶氧量最大值__________ 11.5 生化需氧量最大值______ 15.7 懸浮固體最大值________ 212 氨氮最大值____________ 9.76</p>
                <p v-if="this.selectYear == '109' && selectedRiver === '淡水河'"> 監測站數_______________ 38 溶氧量平均值___________ 6 生化需氧量平均值_______ 2.7 懸浮固體平均值________ 15.9 氨氮平均值____________ 1.44 溶氧量最大值__________ 14.1 生化需氧量最大值______ 337 懸浮固體最大值________ 142 氨氮最大值____________ 10.8</p>
                <p v-if="this.selectYear == '110' && selectedRiver === '淡水河'"> 監測站數_______________ 38 溶氧量平均值___________ 6.5 生化需氧量平均值_______ 3.2 懸浮固體平均值________ 23.4 氨氮平均值____________ 1.42 溶氧量最大值__________ 15.2 生化需氧量最大值______ 19.7 懸浮固體最大值________ 856 氨氮最大值____________ 10.9</p>
                <p v-if="this.selectYear == '111' && selectedRiver === '淡水河'"> 監測站數_______________ 38 溶氧量平均值___________ 7 生化需氧量平均值_______ 2.7 懸浮固體平均值________ 18.9 氨氮平均值____________ 0.73 溶氧量最大值__________ 11.9 生化需氧量最大值______ 46.5 懸浮固體最大值________ 386 氨氮最大值____________ 6.39</p>
                
<!-- 頭前溪 -->
                <p v-if="this.selectYear == '102' && selectedRiver === '頭前溪'"> 監測站數_______________ 8 溶氧量平均值___________ 9.6 生化需氧量平均值_______ 1.6 懸浮固體平均值________ 95.5 氨氮平均值____________ 0.05 溶氧量最大值__________ 11.8 生化需氧量最大值______ 16.3 懸浮固體最大值________ 1630 氨氮最大值____________ 0.26</p>
                <p v-if="this.selectYear == '103' && selectedRiver === '頭前溪'"> 監測站數_______________ 8 溶氧量平均值___________ 9.5 生化需氧量平均值_______ 1.8 懸浮固體平均值________ 176 氨氮平均值____________ 0.06 溶氧量最大值__________ 13.3 生化需氧量最大值______ 11.3 懸浮固體最大值________ 3060 氨氮最大值____________ 0.45</p>
                <p v-if="this.selectYear == '104' && selectedRiver === '頭前溪'"> 監測站數_______________ 8 溶氧量平均值___________ 9.3 生化需氧量平均值_______ 1.4 懸浮固體平均值________ 67.4 氨氮平均值____________ 0.04 溶氧量最大值__________ 13.7 生化需氧量最大值______ 16.4 懸浮固體最大值________ 1070 氨氮最大值____________ 0.35</p>
                <p v-if="this.selectYear == '105' && selectedRiver === '頭前溪'"> 監測站數_______________ 8 溶氧量平均值___________ 9.3 生化需氧量平均值_______ 1.1 懸浮固體平均值________ 21.7 氨氮平均值____________ 0.06 溶氧量最大值__________ 12.4 生化需氧量最大值______ 10.9 懸浮固體最大值________ 226 氨氮最大值____________ 0.61</p>
                <p v-if="this.selectYear == '106' && selectedRiver === '頭前溪'"> 監測站數_______________ 8 溶氧量平均值___________ 9.3 生化需氧量平均值_______ 0.9 懸浮固體平均值________ 37.2 氨氮平均值____________ 0.05 溶氧量最大值__________ 14.4 生化需氧量最大值______ 7.3 懸浮固體最大值________ 608 氨氮最大值____________ 0.48</p>
                <p v-if="this.selectYear == '107' && selectedRiver === '頭前溪'"> 監測站數_______________ 8 溶氧量平均值___________ 9.5 生化需氧量平均值_______ 1 懸浮固體平均值________ 7.4 氨氮平均值____________ 0.08 溶氧量最大值__________ 12.3 生化需氧量最大值______ 3.4 懸浮固體最大值________ 97 氨氮最大值____________ 0.46</p>
                <p v-if="this.selectYear == '108' && selectedRiver === '頭前溪'"> 監測站數_______________ 8 溶氧量平均值___________ 9.2 生化需氧量平均值_______ 1.1 懸浮固體平均值________ 18 氨氮平均值____________ 0.07 溶氧量最大值__________ 13.2 生化需氧量最大值______ 6.9 懸浮固體最大值________ 111 氨氮最大值____________ 0.56</p>
                <p v-if="this.selectYear == '109' && selectedRiver === '頭前溪'"> 監測站數_______________ 8 溶氧量平均值___________ 9.4 生化需氧量平均值_______ 1.1 懸浮固體平均值________ 3.1 氨氮平均值____________ 0.08 溶氧量最大值__________ 11.8 生化需氧量最大值______ 16.4 懸浮固體最大值________ 18 氨氮最大值____________ 0.54</p>
                <p v-if="this.selectYear == '110' && selectedRiver === '頭前溪'"> 監測站數_______________ 8 溶氧量平均值___________ 9.6 生化需氧量平均值_______ 1 懸浮固體平均值________ 5.4 氨氮平均值____________ 0.07 溶氧量最大值__________ 23.1 生化需氧量最大值______ 10.7 懸浮固體最大值________ 83 氨氮最大值____________ 0.67</p>
                <p v-if="this.selectYear == '111' && selectedRiver === '頭前溪'"> 監測站數_______________ 8 溶氧量平均值___________ 9.3 生化需氧量平均值_______ 0.8 懸浮固體平均值________ 14.7 氨氮平均值____________ 0.07 溶氧量最大值__________ 12.2 生化需氧量最大值______ 2.6 懸浮固體最大值________ 199 氨氮最大值____________ 0.6</p>
<!-- 後龍溪 -->
                <p v-if="this.selectYear == '102' && selectedRiver === '後龍溪'"> 監測站數_______________ 4 溶氧量平均值___________ 9 生化需氧量平均值_______ 2.9 懸浮固體平均值________ 14 氨氮平均值____________ 0.25 溶氧量最大值__________ 13.7 生化需氧量最大值______ 25.4 懸浮固體最大值________ 56 氨氮最大值____________ 2.24</p>
                <p v-if="this.selectYear == '103' && selectedRiver === '後龍溪'"> 監測站數_______________ 4 溶氧量平均值___________ 8.4 生化需氧量平均值_______ 4 懸浮固體平均值________ 15.7 氨氮平均值____________ 0.22 溶氧量最大值__________ 13.8 生化需氧量最大值______ 22.8 懸浮固體最大值________ 122 氨氮最大值____________ 1.37</p>
                <p v-if="this.selectYear == '104' && selectedRiver === '後龍溪'"> 監測站數_______________ 4 溶氧量平均值___________ 8 生化需氧量平均值_______ 2.6 懸浮固體平均值________ 11.5 氨氮平均值____________ 0.27 溶氧量最大值__________ 12.1 生化需氧量最大值______ 25.2 懸浮固體最大值________ 45 氨氮最大值____________ 2.16</p>
                <p v-if="this.selectYear == '105' && selectedRiver === '後龍溪'"> 監測站數_______________ 4 溶氧量平均值___________ 8.9 生化需氧量平均值_______ 2.1 懸浮固體平均值________ 12.6 氨氮平均值____________ 0.19 溶氧量最大值__________ 12.3 生化需氧量最大值______ 10.8 懸浮固體最大值________ 128 氨氮最大值____________ 0.88</p>
                <p v-if="this.selectYear == '106' && selectedRiver === '後龍溪'"> 監測站數_______________ 4 溶氧量平均值___________ 8.5 生化需氧量平均值_______ 2.8 懸浮固體平均值________ 11.2 氨氮平均值____________ 0.32 溶氧量最大值__________ 13.2 生化需氧量最大值______ 14.2 懸浮固體最大值________ 31 氨氮最大值____________ 1.75</p>
                <p v-if="this.selectYear == '107' && selectedRiver === '後龍溪'"> 監測站數_______________ 5 溶氧量平均值___________ 7.8 生化需氧量平均值_______ 2.6 懸浮固體平均值________ 12.9 氨氮平均值____________ 0.21 溶氧量最大值__________ 11.6 生化需氧量最大值______ 9.5 懸浮固體最大值________ 53 氨氮最大值____________ 1.41</p>
                <p v-if="this.selectYear == '108' && selectedRiver === '後龍溪'"> 監測站數_______________ 5 溶氧量平均值___________ 8.1 生化需氧量平均值_______ 2.5 懸浮固體平均值________ 22.9 氨氮平均值____________ 0.26 溶氧量最大值__________ 11.7 生化需氧量最大值______ 11.1 懸浮固體最大值________ 101 氨氮最大值____________ 1.19</p>
                <p v-if="this.selectYear == '109' && selectedRiver === '後龍溪'"> 監測站數_______________ 5 溶氧量平均值___________ 7.8 生化需氧量平均值_______ 3.6 懸浮固體平均值________ 14.2 氨氮平均值____________ 0.36 溶氧量最大值__________ 12.2 生化需氧量最大值______ 21.7 懸浮固體最大值________ 76 氨氮最大值____________ 1.97</p>
                <p v-if="this.selectYear == '110' && selectedRiver === '後龍溪'"> 監測站數_______________ 5 溶氧量平均值___________ 7.5 生化需氧量平均值_______ 3.6 懸浮固體平均值________ 21.7 氨氮平均值____________ 0.29 溶氧量最大值__________ 11.3 生化需氧量最大值______ 20.1 懸浮固體最大值________ 162 氨氮最大值____________ 1.22</p>
                <p v-if="this.selectYear == '111' && selectedRiver === '後龍溪'"> 監測站數_______________ 5 溶氧量平均值___________ 7.8 生化需氧量平均值_______ 3.8 懸浮固體平均值________ 24.8 氨氮平均值____________ 0.18 溶氧量最大值__________ 11 生化需氧量最大值______ 22.3 懸浮固體最大值________ 241 氨氮最大值____________ 0.57</p>
<!-- 大安溪 -->
                <p v-if="this.selectYear == '102' && selectedRiver === '大安溪'"> 監測站數_______________ 7 溶氧量平均值___________ 9 生化需氧量平均值_______ 1.2 懸浮固體平均值________ 54 氨氮平均值____________ 0.05 溶氧量最大值__________ 12.7 生化需氧量最大值______ 7.8 懸浮固體最大值________ 482 氨氮最大值____________ 0.27</p>
                <p v-if="this.selectYear == '103' && selectedRiver === '大安溪'"> 監測站數_______________ 7 溶氧量平均值___________ 9.2 生化需氧量平均值_______ 1.3 懸浮固體平均值________ 150.7 氨氮平均值____________ 0.05 溶氧量最大值__________ 12.3 生化需氧量最大值______ 6.5 懸浮固體最大值________ 2180 氨氮最大值____________ 0.33</p>
                <p v-if="this.selectYear == '104' && selectedRiver === '大安溪'"> 監測站數_______________ 7 溶氧量平均值___________ 8.9 生化需氧量平均值_______ 0.8 懸浮固體平均值________ 203.5 氨氮平均值____________ 0.06 溶氧量最大值__________ 11.4 生化需氧量最大值______ 2.1 懸浮固體最大值________ 3150 氨氮最大值____________ 0.26</p>
                <p v-if="this.selectYear == '105' && selectedRiver === '大安溪'"> 監測站數_______________ 7 溶氧量平均值___________ 8.6 生化需氧量平均值_______ 1.2 懸浮固體平均值________ 29.4 氨氮平均值____________ 0.05 溶氧量最大值__________ 12.7 生化需氧量最大值______ 5 懸浮固體最大值________ 265 氨氮最大值____________ 0.16</p>
                <p v-if="this.selectYear == '106' && selectedRiver === '大安溪'"> 監測站數_______________ 7 溶氧量平均值___________ 8.9 生化需氧量平均值_______ 1.1 懸浮固體平均值________ 47.9 氨氮平均值____________ 0.06 溶氧量最大值__________ 11.2 生化需氧量最大值______ 3.7 懸浮固體最大值________ 402 氨氮最大值____________ 0.19</p>
                <p v-if="this.selectYear == '107' && selectedRiver === '大安溪'"> 監測站數_______________ 8 溶氧量平均值___________ 8.7 生化需氧量平均值_______ 1.4 懸浮固體平均值________ 32.6 氨氮平均值____________ 0.07 溶氧量最大值__________ 13.2 生化需氧量最大值______ 6.7 懸浮固體最大值________ 574 氨氮最大值____________ 0.19</p>
                <p v-if="this.selectYear == '108' && selectedRiver === '大安溪'"> 監測站數_______________ 8 溶氧量平均值___________ 8.8 生化需氧量平均值_______ 2.1 懸浮固體平均值________ 158.8 氨氮平均值____________ 0.08 溶氧量最大值__________ 11.1 生化需氧量最大值______ 7.7 懸浮固體最大值________ 2640 氨氮最大值____________ 0.21</p>
                <p v-if="this.selectYear == '109' && selectedRiver === '大安溪'"> 監測站數_______________ 8 溶氧量平均值___________ 8.9 生化需氧量平均值_______ 1.9 懸浮固體平均值________ 13.2 氨氮平均值____________ 0.07 溶氧量最大值__________ 12.2 生化需氧量最大值______ 6.6 懸浮固體最大值________ 139 氨氮最大值____________ 0.19</p>
                <p v-if="this.selectYear == '110' && selectedRiver === '大安溪'"> 監測站數_______________ 8 溶氧量平均值___________ 8.5 生化需氧量平均值_______ 1.4 懸浮固體平均值________ 15.1 氨氮平均值____________ 0.05 溶氧量最大值__________ 10.3 生化需氧量最大值______ 6.5 懸浮固體最大值________ 102 氨氮最大值____________ 0.19</p>
                <p v-if="this.selectYear == '111' && selectedRiver === '大安溪'"> 監測站數_______________ 8 溶氧量平均值___________ 8.4 生化需氧量平均值_______ 3.6 懸浮固體平均值________ 87.4 氨氮平均值____________ 0.04 溶氧量最大值__________ 10.5 生化需氧量最大值______ 16.1 懸浮固體最大值________ 883 氨氮最大值____________ 0.17</p>
<!-- 大甲溪 -->
                <p v-if="this.selectYear == '102' && selectedRiver === '大甲溪'"> 監測站數_______________ 9 溶氧量平均值___________ 9 生化需氧量平均值_______ 2.1 懸浮固體平均值________ 14.3 氨氮平均值____________ 0.04 溶氧量最大值__________ 11.9 生化需氧量最大值______ 43.3 懸浮固體最大值________ 196 氨氮最大值____________ 0.46</p>
                <p v-if="this.selectYear == '103' && selectedRiver === '大甲溪'"> 監測站數_______________ 9 溶氧量平均值___________ 9 生化需氧量平均值_______ 1.8 懸浮固體平均值________ 32.5 氨氮平均值____________ 0.1 溶氧量最大值__________ 12 生化需氧量最大值______ 32.5 懸浮固體最大值________ 1260 氨氮最大值____________ 2.76</p>
                <p v-if="this.selectYear == '104' && selectedRiver === '大甲溪'"> 監測站數_______________ 9 溶氧量平均值___________ 9.1 生化需氧量平均值_______ 0.9 懸浮固體平均值________ 17.9 氨氮平均值____________ 0.05 溶氧量最大值__________ 11.6 生化需氧量最大值______ 5.5 懸浮固體最大值________ 156 氨氮最大值____________ 0.24</p>
                <p v-if="this.selectYear == '105' && selectedRiver === '大甲溪'"> 監測站數_______________ 9 溶氧量平均值___________ 9.1 生化需氧量平均值_______ 0.8 懸浮固體平均值________ 22.7 氨氮平均值____________ 0.06 溶氧量最大值__________ 11.3 生化需氧量最大值______ 8.9 懸浮固體最大值________ 352 氨氮最大值____________ 0.6</p>
                <p v-if="this.selectYear == '106' && selectedRiver === '大甲溪'"> 監測站數_______________ 9 溶氧量平均值___________ 9.4 生化需氧量平均值_______ 1 懸浮固體平均值________ 15.1 氨氮平均值____________ 0.07 溶氧量最大值__________ 11.7 生化需氧量最大值______ 4.6 懸浮固體最大值________ 130 氨氮最大值____________ 0.34</p>
                <p v-if="this.selectYear == '107' && selectedRiver === '大甲溪'"> 監測站數_______________ 9 溶氧量平均值___________ 9.1 生化需氧量平均值_______ 1.2 懸浮固體平均值________ 6.7 氨氮平均值____________ 0.08 溶氧量最大值__________ 11 生化需氧量最大值______ 6.9 懸浮固體最大值________ 39 氨氮最大值____________ 0.2</p>
                <p v-if="this.selectYear == '108' && selectedRiver === '大甲溪'"> 監測站數_______________ 9 溶氧量平均值___________ 9.2 生化需氧量平均值_______ 1.7 懸浮固體平均值________ 8.6 氨氮平均值____________ 0.1 溶氧量最大值__________ 12.8 生化需氧量最大值______ 6.3 懸浮固體最大值________ 65 氨氮最大值____________ 0.4</p>
                <p v-if="this.selectYear == '109' && selectedRiver === '大甲溪'"> 監測站數_______________ 9 溶氧量平均值___________ 9.2 生化需氧量平均值_______ 2.5 懸浮固體平均值________ 9.7 氨氮平均值____________ 0.07 溶氧量最大值__________ 11.4 生化需氧量最大值______ 20.3 懸浮固體最大值________ 190 氨氮最大值____________ 0.17</p>
                <p v-if="this.selectYear == '110' && selectedRiver === '大甲溪'"> 監測站數_______________ 9 溶氧量平均值___________ 8.9 生化需氧量平均值_______ 2.8 懸浮固體平均值________ 7.9 氨氮平均值____________ 0.08 溶氧量最大值__________ 12 生化需氧量最大值______ 36 懸浮固體最大值________ 80 氨氮最大值____________ 1.19</p>
                <p v-if="this.selectYear == '111' && selectedRiver === '大甲溪'"> 監測站數_______________ 9 溶氧量平均值___________ 9.1 生化需氧量平均值_______ 3.8 懸浮固體平均值________ 8.2 氨氮平均值____________ 0.04 溶氧量最大值__________ 16.6 生化需氧量最大值______ 35 懸浮固體最大值________ 76 氨氮最大值____________ 0.15</p>
<!-- 烏溪 -->
                <p v-if="this.selectYear == '102' && selectedRiver === '烏溪'"> 監測站數_______________ 20 溶氧量平均值___________ 8.1 生化需氧量平均值_______ 4.6 懸浮固體平均值________ 96.3 氨氮平均值____________ 0.85 溶氧量最大值__________ 14.4 生化需氧量最大值______ 81.8 懸浮固體最大值________ 2590 氨氮最大值____________ 5.27</p>
                <p v-if="this.selectYear == '103' && selectedRiver === '烏溪'"> 監測站數_______________ 20 溶氧量平均值___________ 8.2 生化需氧量平均值_______ 3.3 懸浮固體平均值________ 216.2 氨氮平均值____________ 0.88 溶氧量最大值__________ 11.7 生化需氧量最大值______ 23.4 懸浮固體最大值________ 8740 氨氮最大值____________ 5.85</p>
                <p v-if="this.selectYear == '104' && selectedRiver === '烏溪'"> 監測站數_______________ 20 溶氧量平均值___________ 8 生化需氧量平均值_______ 3.1 懸浮固體平均值________ 43.5 氨氮平均值____________ 1.02 溶氧量最大值__________ 13.1 生化需氧量最大值______ 22.8 懸浮固體最大值________ 812 氨氮最大值____________ 9.54</p>
                <p v-if="this.selectYear == '105' && selectedRiver === '烏溪'"> 監測站數_______________ 20 溶氧量平均值___________ 8 生化需氧量平均值_______ 2.6 懸浮固體平均值________ 40.8 氨氮平均值____________ 0.7 溶氧量最大值__________ 11 生化需氧量最大值______ 15.7 懸浮固體最大值________ 703 氨氮最大值____________ 4.84</p>
                <p v-if="this.selectYear == '106' && selectedRiver === '烏溪'"> 監測站數_______________ 20 溶氧量平均值___________ 8 生化需氧量平均值_______ 2.4 懸浮固體平均值________ 120.1 氨氮平均值____________ 0.71 溶氧量最大值__________ 11.8 生化需氧量最大值______ 12.9 懸浮固體最大值________ 3560 氨氮最大值____________ 4.56</p>
                <p v-if="this.selectYear == '107' && selectedRiver === '烏溪'"> 監測站數_______________ 19 溶氧量平均值___________ 8.1 生化需氧量平均值_______ 2.9 懸浮固體平均值________ 48.4 氨氮平均值____________ 0.68 溶氧量最大值__________ 12.4 生化需氧量最大值______ 15.6 懸浮固體最大值________ 855 氨氮最大值____________ 4.04</p>
                <p v-if="this.selectYear == '108' && selectedRiver === '烏溪'"> 監測站數_______________ 19 溶氧量平均值___________ 8 生化需氧量平均值_______ 3.3 懸浮固體平均值________ 65.9 氨氮平均值____________ 0.44 溶氧量最大值__________ 12.2 生化需氧量最大值______ 36.3 懸浮固體最大值________ 1150 氨氮最大值____________ 4.3</p>
                <p v-if="this.selectYear == '109' && selectedRiver === '烏溪'"> 監測站數_______________ 19 溶氧量平均值___________ 8 生化需氧量平均值_______ 3.5 懸浮固體平均值________ 34.1 氨氮平均值____________ 0.74 溶氧量最大值__________ 12 生化需氧量最大值______ 15.5 懸浮固體最大值________ 611 氨氮最大值____________ 7.78</p>
                <p v-if="this.selectYear == '110' && selectedRiver === '烏溪'"> 監測站數_______________ 19 溶氧量平均值___________ 7.7 生化需氧量平均值_______ 3.9 懸浮固體平均值________ 29.2 氨氮平均值____________ 0.85 溶氧量最大值__________ 10.2 生化需氧量最大值______ 31.1 懸浮固體最大值________ 489 氨氮最大值____________ 5.1</p>
                <p v-if="this.selectYear == '111' && selectedRiver === '烏溪'"> 監測站數_______________ 19 溶氧量平均值___________ 7.9 生化需氧量平均值_______ 4.6 懸浮固體平均值________ 40 氨氮平均值____________ 0.68 溶氧量最大值__________ 10.9 生化需氧量最大值______ 24.6 懸浮固體最大值________ 240 氨氮最大值____________ 4.34</p>
<!-- 濁水溪 -->
                <p v-if="this.selectYear == '102' && selectedRiver === '濁水溪'"> 監測站數 ________________ 5 溶氧量平均值___________ 8.9 生化需氧量平均值_______ 3.4 懸浮固體平均值______ 1316.9 氨氮平均值____________ 0.09 溶氧量最大值__________ 11.9 生化需氧量最大值______ 11.2 懸浮固體最大值 _______ 9190 氨氮最大值____________ 0.42</p>
                <p v-if="this.selectYear == '103' && selectedRiver === '濁水溪'"> 監測站數 ________________ 5 溶氧量平均值___________ 8.6 生化需氧量平均值_______ 1.5 懸浮固體平均值 _______ 1328 氨氮平均值____________ 0.12 溶氧量最大值__________ 13.5 生化需氧量最大值_______ 5.8 懸浮固體最大值 ______ 11100 氨氮最大值____________ 0.42</p>
                <p v-if="this.selectYear == '104' && selectedRiver === '濁水溪'"> 監測站數 ________________ 5 溶氧量平均值___________ 8.6 生化需氧量平均值_______ 1.5 懸浮固體平均值_______ 589.7 氨氮平均值____________ 0.13 溶氧量最大值__________ 13.8 生化需氧量最大值_______ 5.1 懸浮固體最大值 _______ 3350 氨氮最大值____________ 0.49</p>
                <p v-if="this.selectYear == '105' && selectedRiver === '濁水溪'"> 監測站數 ________________ 5 溶氧量平均值___________ 8.7 生化需氧量平均值_______ 1.7 懸浮固體平均值______ 1175.6 氨氮平均值____________ 0.14 溶氧量最大值__________ 12.7 生化需氧量最大值_______ 9.9 懸浮固體最大值 _______ 8560 氨氮最大值____________ 0.47</p>
                <p v-if="this.selectYear == '106' && selectedRiver === '濁水溪'"> 監測站數 ________________ 7 溶氧量平均值___________ 8.7 生化需氧量平均值_______ 1.2 懸浮固體平均值_______ 647.2 氨氮平均值____________ 0.09 溶氧量最大值__________ 12.7 生化需氧量最大值_______ 4.7 懸浮固體最大值 _______ 6880 氨氮最大值____________ 0.29</p>
                <p v-if="this.selectYear == '107' && selectedRiver === '濁水溪'"> 監測站數_______________ 7 溶氧量平均值___________ 8.7 生化需氧量平均值_______ 1.6 懸浮固體平均值 ________ 433 氨氮平均值____________ 0.1 溶氧量最大值__________ 11.9 生化需氧量最大值______ 6.4 懸浮固體最大值 _______ 4380 氨氮最大值____________ 0.31</p>
                <p v-if="this.selectYear == '108' && selectedRiver === '濁水溪'"> 監測站數_______________ 7 溶氧量平均值___________ 8.5 生化需氧量平均值_______ 1.7 懸浮固體平均值_______ 634.4 氨氮平均值____________ 0.1 溶氧量最大值__________ 10.2 生化需氧量最大值_______ 9 懸浮固體最大值_______ 4720 氨氮最大值____________ 0.5</p>
                <p v-if="this.selectYear == '109' && selectedRiver === '濁水溪'"> 監測站數_______________ 7 溶氧量平均值___________ 8.6 生化需氧量平均值_______ 2.1 懸浮固體平均值_______ 194.5 氨氮平均值____________ 0.13 溶氧量最大值__________ 11.2 生化需氧量最大值______ 6.6 懸浮固體最大值_______ 2720 氨氮最大值____________ 0.59</p>
                <p v-if="this.selectYear == '110' && selectedRiver === '濁水溪'"> 監測站數_______________ 7 溶氧量平均值___________ 8.8 生化需氧量平均值_______ 2.8 懸浮固體平均值_______ 138.6 氨氮平均值____________ 0.13 溶氧量最大值__________ 11.5 生化需氧量最大值______ 24.5 懸浮固體最大值_______ 1290 氨氮最大值____________ 0.67</p>
                <p v-if="this.selectYear == '111' && selectedRiver === '濁水溪'"> 監測站數_______________ 7 溶氧量平均值___________ 8.5 生化需氧量平均值_______ 3.7 懸浮固體平均值_______ 232.8 氨氮平均值____________ 0.1 溶氧量最大值__________ 9.7 生化需氧量最大值______ 19 懸浮固體最大值_______ 1610 氨氮最大值____________ 0.33</p>
<!-- 北港溪 -->
                <p v-if="this.selectYear == '102' && selectedRiver === '北港溪'"> 監測站數_______________ 9 溶氧量平均值___________ 5.8 生化需氧量平均值_______ 10.7 懸浮固體平均值________ 171.9 氨氮平均值____________ 5.28 溶氧量最大值__________ 11.7 生化需氧量最大值______ 220 懸浮固體最大值________ 1200 氨氮最大值____________ 87.8</p>
                <p v-if="this.selectYear == '103' && selectedRiver === '北港溪'"> 監測站數_______________ 9 溶氧量平均值___________ 5.9 生化需氧量平均值_______ 8.4 懸浮固體平均值________ 348.8 氨氮平均值____________ 3.88 溶氧量最大值__________ 10.5 生化需氧量最大值______ 60.3 懸浮固體最大值________ 9310 氨氮最大值____________ 19.6</p>
                <p v-if="this.selectYear == '104' && selectedRiver === '北港溪'"> 監測站數_______________ 9 溶氧量平均值___________ 6.6 生化需氧量平均值_______ 7.3 懸浮固體平均值________ 93.7 氨氮平均值____________ 3.98 溶氧量最大值__________ 19.7 生化需氧量最大值______ 45.9 懸浮固體最大值________ 1340 氨氮最大值____________ 38.1</p>
                <p v-if="this.selectYear == '105' && selectedRiver === '北港溪'"> 監測站數_______________ 9 溶氧量平均值___________ 6.3 生化需氧量平均值_______ 5.6 懸浮固體平均值________ 198.6 氨氮平均值____________ 1.71 溶氧量最大值__________ 15.3 生化需氧量最大值______ 37.1 懸浮固體最大值________ 3380 氨氮最大值____________ 10.1</p>
                <p v-if="this.selectYear == '106' && selectedRiver === '北港溪'"> 監測站數_______________ 9 溶氧量平均值___________ 6.3 生化需氧量平均值_______ 6.3 懸浮固體平均值________ 132.8 氨氮平均值____________ 2.05 溶氧量最大值__________ 10.4 生化需氧量最大值______ 29.2 懸浮固體最大值________ 1470 氨氮最大值____________ 10.3</p>
                <p v-if="this.selectYear == '107' && selectedRiver === '北港溪'"> 監測站數_______________ 6 溶氧量平均值___________ 5.8 生化需氧量平均值_______ 6.5 懸浮固體平均值________ 131.3 氨氮平均值____________ 2.57 溶氧量最大值__________ 9.3 生化需氧量最大值______ 27 懸浮固體最大值________ 842 氨氮最大值____________ 8</p>
                <p v-if="this.selectYear == '108' && selectedRiver === '北港溪'"> 監測站數_______________ 7 溶氧量平均值___________ 5.9 生化需氧量平均值_______ 6.1 懸浮固體平均值________ 135.7 氨氮平均值____________ 1.13 溶氧量最大值__________ 10.8 生化需氧量最大值______ 42.9 懸浮固體最大值________ 1180 氨氮最大值____________ 6.98</p>
                <p v-if="this.selectYear == '109' && selectedRiver === '北港溪'"> 監測站數_______________ 9 溶氧量平均值___________ 6 生化需氧量平均值_______ 3.7 懸浮固體平均值________ 232.8 氨氮平均值____________ 0.1 溶氧量最大值__________ 9.7 生化需氧量最大值______ 19 懸浮固體最大值________ 1610 氨氮最大值____________ 0.33</p>
                <p v-if="this.selectYear == '102' && selectedRiver === '北港溪'"> 監測站數_______________ 9 溶氧量平均值___________ 6 生化需氧量平均值_______ 3.7 懸浮固體平均值________ 232.8 氨氮平均值____________ 0.1 溶氧量最大值__________ 9.7 生化需氧量最大值______ 19 懸浮固體最大值________ 1610 氨氮最大值____________ 0.33</p>
                <p v-if="this.selectYear == '102' && selectedRiver === '北港溪'"> 監測站數_______________ 9 溶氧量平均值___________ 6 生化需氧量平均值_______ 3.7 懸浮固體平均值________ 232.8 氨氮平均值____________ 0.1 溶氧量最大值__________ 9.7 生化需氧量最大值______ 19 懸浮固體最大值________ 1610 氨氮最大值____________ 0.33</p>
            
            <!--<p>監測站數______________ 38</p>
                <p>溶氧量平均值__________ 7</p>
                <p>生化需氧量平均值______ 2.7</p>
                <p>懸浮固體平均值________ 18.9</p>
                <p>氨氮平均值____________ 0.73</p>
                <p>溶氧量最大值__________ 11.9</p>
                <p>生化需氧量最大值______ 46.5</p>
                <p>懸浮固體最大值________ 386</p>
                <p>氨氮最大值____________ 6.39</p>-->
            </div>
        </div>
        <div class="rpi" v-bind="this.selectVal">
            <h4>RPI</h4>
            <div class="red" value="red"></div>
            <div class="orange" value="orange"></div>
            <div class="yello" value="yello"></div>
            <div class="green" value="green"></div>
        </div>
        <div class="rpiValue">
            <p>6.0</p>
            <p>3.0</p>
            <p>2.0</p>
        </div>
    </div>
</template>


<style scoped lang="scss">
.backGround{
    width: 100vw;
    height: 100vh;
    position: relative;
    background-image: url('water figma.jpg');
    background-repeat: no-repeat;
    background-size: cover;
    display: flex; // ⤵固定map、info、rpi的大div並排在底部
    align-items: flex-end;
    //justify-content: center;
}
.map{
    width: 50dvw;
    height: 85dvh;
    //border: 1px solid black;
    display: flex;
    justify-content: center;
    align-items: center;
    position: relative;
    .kawaTW{
        width: 44%;  
    }
    p{
        position: absolute;
        width: 100px;
        height: 50px;
        font-size: 20px;
        font-weight: 600;
        color: rgb(219, 238, 255);
        text-shadow: 0px 1px 2px rgb(250, 87, 114);
        cursor: pointer;
        transition: 0.3s;
        &:hover{
            color: rgb(255, 169, 40);
        }
        &:active{
            scale: 0.95;
        }
    }
    .A{
        left: 50%;
        top: 0%;
    }
    .B{
        left: 40%;
        top: 9%;
    }
    .C{
        left: 36%;
        top: 15%;
    }
    .D{
        left: 34%;
        top: 20%;
    }
    .E{
        left: 32%;
        top: 25%;
    }
    .F{
        left: 32%;
        top: 30%;
    }
    .G{
        left: 26%;
        top: 39%;
    }
    .H{
        left: 22%;
        top: 47%;
    }
    .I{
        left: 23%;
        top: 51%;
    }
    .J{
        left: 22%;
        top: 55%;
    }
    .K{
        left: 21%;
        top: 59%;
    }
    .L{
        left: 20%;
        top: 63%;
    }
    .M{
        left: 22%;
        bottom: 25%;
    }
    .N{
        left: 24%;
        bottom: 21%;
    }
    .O{
        left: 27%;
        bottom: 12%;
    }
    .P{
        left: 30%;
        bottom: 8%;
    }
    .Q{
        left: 33%;
        bottom: 4%;
    }
    .R{
        left: 71%;
        top: 15%;
    }
    .S{
        left: 67%;
        top: 40%;
    }
    .T{
        left: 65%;
        bottom: 40%;
    }
    .U{
        left: 57%;
        bottom: 18%;
    }
}
.info{
    width: 23dvw;
    height: 83dvh;
    //border: 1px solid gray;
    margin: 20px;
    background-color: rgba(128, 128, 128, 0.599);
    box-shadow: rgba(0, 0, 0, 0.36) 0px 10px 36px 0px, rgba(0, 0, 0, 0.06) 0px 0px 0px 1px;
    border-radius: 30px;
    display: flex;
    flex-direction: column;
    justify-content: center;
    align-items: center;
    .riverName{
        height: 15%;
        width: 88%;
        display: flex;
        justify-content: space-around;
        align-items: center;
        color: azure;
        text-shadow: -1px 0 #000, 0 1px #000,
        1px 0 #000, 0 -1px #000;
        h2{
            padding: 10%;
        }
    }
    .rpiCard{
        height: 30%;
        width: 50%;
        margin: 10px;
        position: relative;
        &:hover .front{
            transform: rotateY(180deg);
        }
        &:hover .back{
            transform: rotateY(0deg);
        }
        
        .size{
            width: 100%;
            height: 100%;
            position: absolute;
            border: 5px solid rgb(32, 179, 32);
            border-radius: 50%;
            box-shadow: rgba(0, 0, 0, 0.34) 0px 3px 8px;
            //以下是圓圈中的內容樣式
            font-weight: 600;
            display: flex;
            flex-direction: column;
            justify-content: space-around;
            align-items: center;
            background-color: #c3f3c3;
            //翻轉效果 !!!
            transition: transform 1.0s ease;
            backface-visibility: hidden;
        }
        .front{
            font-size: 30px;
            transform:  rotateY(0deg);
           /* &:hover{
                transform: rotateY(180deg);
            }*/
        }
        .back{
            transform: rotateY(-180deg);
          /*  &:hover{
                transform: rotateY(0deg);
            }*/
            i{
                font-size: 60px;
                color: rgb(233, 188, 42)
            }
        }
    }
    .testValue{
        height: 45%;
        width: 80%;
        font-size: 20px;
        text-shadow: -1px 0 #000, 0 1px #000,
        1px 0 #000, 0 -1px #000;
        p{
            margin: 10px;
            color: azure;
        }
    }
}
.rpi{
    width: 5dvw;
    height: 50dvh;
    //border: 1px solid black;
    display: flex;
    flex-direction: column;
    justify-content: end;
    align-items: center;
    padding-bottom: 2%;
    font-size: 20px;
    color: azure;
    div{
        width: 15px;
        height: 80px;
        transition: 0.5s;
        &:hover{
            scale: 1.15;
        }
        &:active{
            scale: 0.95;
        }
    }
    .red{
        background-color: red;
    }
    .orange{
        background-color: orange;
    }
    .yello{
        background-color:yellow;
    }
    .green{
        background-color: rgb(32, 179, 32);
    }
}
.rpiValue{
    width: 15px;
    height: 42dvh;
    display: flex;
    flex-direction: column;
    justify-content: space-around;
    padding-bottom: 70px;
    //border: 1px solid black;
    p{
        color: azure;
    }
}
</style>